/*
if만약에 ~이면
예) 만약에 수업이 끝나고 친구를 만나면 저녁을 먹다

    if (친구를 만나면){
        저녁을 먹다
    }//아니면 {}밖으로 나간다.

예) 만약에 수업이 끝나고 친구를 만나면 저녁을 먹다
    그렇지 않으면 집에간다
    
    if(친구를 만나면){
        저녁을 먹다
    }else{
        집에간다
    }

다중 if문 결과 -1 if문의 갯수 

예) 철수를 만나면 커피를 마시고
    영희를 만나면 술을 마시고
    재석이를 만나면 고기를 먹고
    호동을 만나면 저녁을 먹는다
    아무도 만나지 않으면 집에간다

    if(철수를 만나면){
        커피를 마시고
    }else if(영희를 만나면){
        술을 마시고
    }else if(재석이를 만나면){
        고기를 먹고
    }else if(재석이를 만나면){
        고기를 먹고
    }else if(호동을 만나면){
        저녁을 먹는다
    }else{
        집에간다
    }



if(조건식){
    실행문;
}



*/